{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 227, 227, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "conv1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu_conv1"}, "inbound_nodes": [[["conv1", 0, 0]]], "name": "relu_conv1"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["relu_conv1", 0, 0]]], "name": "pool1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire2/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["pool1", 0, 0]]], "name": "fire2/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_squeeze1x1"}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0]]], "name": "fire2/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire2/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0]]], "name": "fire2/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire2/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0]]], "name": "fire2/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand1x1"}, "inbound_nodes": [[["fire2/expand1x1", 0, 0]]], "name": "fire2/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand3x3"}, "inbound_nodes": [[["fire2/expand3x3", 0, 0]]], "name": "fire2/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire2/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0], ["fire2/relu_expand3x3", 0, 0]]], "name": "fire2/concat"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire3/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire2/concat", 0, 0]]], "name": "fire3/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_squeeze1x1"}, "inbound_nodes": [[["fire3/squeeze1x1", 0, 0]]], "name": "fire3/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire3/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0]]], "name": "fire3/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire3/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0]]], "name": "fire3/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand1x1"}, "inbound_nodes": [[["fire3/expand1x1", 0, 0]]], "name": "fire3/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand3x3"}, "inbound_nodes": [[["fire3/expand3x3", 0, 0]]], "name": "fire3/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire3/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0], ["fire3/relu_expand3x3", 0, 0]]], "name": "fire3/concat"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["fire3/concat", 0, 0]]], "name": "pool3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire4/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["pool3", 0, 0]]], "name": "fire4/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_squeeze1x1"}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0]]], "name": "fire4/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire4/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0]]], "name": "fire4/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire4/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0]]], "name": "fire4/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand1x1"}, "inbound_nodes": [[["fire4/expand1x1", 0, 0]]], "name": "fire4/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand3x3"}, "inbound_nodes": [[["fire4/expand3x3", 0, 0]]], "name": "fire4/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire4/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0], ["fire4/relu_expand3x3", 0, 0]]], "name": "fire4/concat"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire5/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire4/concat", 0, 0]]], "name": "fire5/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_squeeze1x1"}, "inbound_nodes": [[["fire5/squeeze1x1", 0, 0]]], "name": "fire5/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire5/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0]]], "name": "fire5/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire5/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0]]], "name": "fire5/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand1x1"}, "inbound_nodes": [[["fire5/expand1x1", 0, 0]]], "name": "fire5/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand3x3"}, "inbound_nodes": [[["fire5/expand3x3", 0, 0]]], "name": "fire5/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire5/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0], ["fire5/relu_expand3x3", 0, 0]]], "name": "fire5/concat"}, {"class_name": "MaxPooling2D", "config": {"name": "pool5", "trainable": true, "dim_ordering": "tf", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["fire5/concat", 0, 0]]], "name": "pool5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire6/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["pool5", 0, 0]]], "name": "fire6/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_squeeze1x1"}, "inbound_nodes": [[["fire6/squeeze1x1", 0, 0]]], "name": "fire6/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire6/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0]]], "name": "fire6/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire6/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0]]], "name": "fire6/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand1x1"}, "inbound_nodes": [[["fire6/expand1x1", 0, 0]]], "name": "fire6/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand3x3"}, "inbound_nodes": [[["fire6/expand3x3", 0, 0]]], "name": "fire6/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire6/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0], ["fire6/relu_expand3x3", 0, 0]]], "name": "fire6/concat"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire7/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire6/concat", 0, 0]]], "name": "fire7/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_squeeze1x1"}, "inbound_nodes": [[["fire7/squeeze1x1", 0, 0]]], "name": "fire7/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire7/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0]]], "name": "fire7/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire7/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0]]], "name": "fire7/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand1x1"}, "inbound_nodes": [[["fire7/expand1x1", 0, 0]]], "name": "fire7/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand3x3"}, "inbound_nodes": [[["fire7/expand3x3", 0, 0]]], "name": "fire7/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire7/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0], ["fire7/relu_expand3x3", 0, 0]]], "name": "fire7/concat"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire8/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire7/concat", 0, 0]]], "name": "fire8/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_squeeze1x1"}, "inbound_nodes": [[["fire8/squeeze1x1", 0, 0]]], "name": "fire8/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire8/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0]]], "name": "fire8/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire8/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0]]], "name": "fire8/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand1x1"}, "inbound_nodes": [[["fire8/expand1x1", 0, 0]]], "name": "fire8/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand3x3"}, "inbound_nodes": [[["fire8/expand3x3", 0, 0]]], "name": "fire8/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire8/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0], ["fire8/relu_expand3x3", 0, 0]]], "name": "fire8/concat"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire9/squeeze1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire8/concat", 0, 0]]], "name": "fire9/squeeze1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_squeeze1x1"}, "inbound_nodes": [[["fire9/squeeze1x1", 0, 0]]], "name": "fire9/relu_squeeze1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire9/expand1x1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0]]], "name": "fire9/expand1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "fire9/expand3x3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0]]], "name": "fire9/expand3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand1x1"}, "inbound_nodes": [[["fire9/expand1x1", 0, 0]]], "name": "fire9/relu_expand1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand3x3"}, "inbound_nodes": [[["fire9/expand3x3", 0, 0]]], "name": "fire9/relu_expand3x3"}, {"class_name": "Merge", "config": {"name": "fire9/concat", "concat_axis": 3, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0], ["fire9/relu_expand3x3", 0, 0]]], "name": "fire9/concat"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "drop9"}, "inbound_nodes": [[["fire9/concat", 0, 0]]], "name": "drop9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv10", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 1, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 2, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["drop9", 0, 0]]], "name": "conv10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "relu_conv10"}, "inbound_nodes": [[["conv10", 0, 0]]], "name": "relu_conv10"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "tf"}, "inbound_nodes": [[["relu_conv10", 0, 0]]], "name": "globalaveragepooling2d_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "loss"}, "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "name": "loss"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["loss", 0, 0]], "name": "model_1"}}