{"backend": "tensorflow", "config": {"output_layers": [["loss", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "squeezenet", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 227, 227, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "conv1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2]}}, {"class_name": "Activation", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "relu_conv1", "config": {"activation": "relu", "trainable": true, "name": "relu_conv1"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "pool1", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire2/squeeze1x1", "filters": 16, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire2/expand1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire2/expand3x3", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire2/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "name": "fire2/concat", "config": {"axis": 3, "trainable": true, "name": "fire2/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "fire3/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire3/squeeze1x1", "filters": 16, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "name": "fire3/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire3/expand1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire3/expand3x3", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "name": "fire3/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "name": "fire3/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire3/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "name": "fire3/concat", "config": {"axis": 3, "trainable": true, "name": "fire3/concat"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "name": "pool3", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "pool3", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "fire4/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire4/squeeze1x1", "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire4/expand1x1", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire4/expand3x3", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire4/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "name": "fire4/concat", "config": {"axis": 3, "trainable": true, "name": "fire4/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "fire5/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire5/squeeze1x1", "filters": 32, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "name": "fire5/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire5/expand1x1", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire5/expand3x3", "filters": 128, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "name": "fire5/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "name": "fire5/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire5/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "name": "fire5/concat", "config": {"axis": 3, "trainable": true, "name": "fire5/concat"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "name": "pool5", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "pool5", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "fire6/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire6/squeeze1x1", "filters": 48, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "name": "fire6/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire6/expand1x1", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire6/expand3x3", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "name": "fire6/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "name": "fire6/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire6/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "name": "fire6/concat", "config": {"axis": 3, "trainable": true, "name": "fire6/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "name": "fire7/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire7/squeeze1x1", "filters": 48, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "name": "fire7/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire7/expand1x1", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire7/expand3x3", "filters": 192, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "name": "fire7/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "name": "fire7/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire7/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "name": "fire7/concat", "config": {"axis": 3, "trainable": true, "name": "fire7/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "name": "fire8/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire8/squeeze1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "name": "fire8/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire8/expand1x1", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire8/expand3x3", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "name": "fire8/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "name": "fire8/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire8/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "name": "fire8/concat", "config": {"axis": 3, "trainable": true, "name": "fire8/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "name": "fire9/squeeze1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire9/squeeze1x1", "filters": 64, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "name": "fire9/relu_squeeze1x1", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_squeeze1x1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand1x1", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "fire9/expand1x1", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand3x3", "config": {"kernel_size": [3, 3], "use_bias": true, "padding": "same", "kernel_regularizer": null, "name": "fire9/expand3x3", "filters": 256, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "name": "fire9/relu_expand1x1", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand1x1"}}, {"class_name": "Activation", "inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "name": "fire9/relu_expand3x3", "config": {"activation": "relu", "trainable": true, "name": "fire9/relu_expand3x3"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "name": "fire9/concat", "config": {"axis": 3, "trainable": true, "name": "fire9/concat"}}, {"class_name": "Dropout", "inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "name": "drop9", "config": {"rate": 0.5, "trainable": true, "name": "drop9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10-final", "config": {"kernel_size": [1, 1], "use_bias": true, "padding": "valid", "kernel_regularizer": null, "name": "conv10-final", "filters": 4, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1]}}, {"class_name": "Activation", "inbound_nodes": [[["conv10-final", 0, 0, {}]]], "name": "relu_conv10", "config": {"activation": "relu", "trainable": true, "name": "relu_conv10"}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"class_name": "Activation", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "loss", "config": {"activation": "softmax", "trainable": true, "name": "loss"}}]}, "keras_version": "2.0.6", "class_name": "Model"}